---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LineShapeAtCorner
source: html/a79fef53-d41b-4ff6-5c85-e12b53add0af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LineShapeAtCorner Property

"Line Shape at Landing Corner"

## Syntax (C#)
```csharp
public static ForgeTypeId LineShapeAtCorner { get; }
```